# 동전 거스르기
# 거스름돈: 78760
#   50000원     1장
#   10000원     2장
#   5000원      1장
#   1000원      3장
#   500원       1개
#   100원       2개
#   50원        1개
#   10원        1개

money = int(input("처음 돈: "))
m_50000 = money // 50000
cnt_50000 = money % 50000
print(f"50000원: {m_50000}장")

m_10000 = cnt_50000 // 10000
cnt_10000 = cnt_50000 % 10000
print(f"50000원: {m_10000}장")

m_5000 = cnt_10000 // 5000
cnt_5000 = cnt_10000 % 5000
print(f"10000원: {m_5000}장")

m_1000 = cnt_5000 // 1000
cnt_1000 = cnt_5000 % 1000
print(f"5000원: {m_1000}장")

m_500 = cnt_1000 // 500
cnt_500 = cnt_1000 % 500
print(f"1000원: {m_500}장")

m_100 = cnt_500 // 100
cnt_100 = cnt_500 % 100
print(f"100원: {m_100}개")

m_50 = cnt_100 // 50
cnt_50 = cnt_100 % 50
print(f"50원: {m_50}개")

m_10 = cnt_50 // 10
cnt_10 = cnt_50 % 10
print(f"10원: {m_10}개")